Revit 2024 API
ValueParsingOptions.SetFormatOptions Method
 Sets the FormatOptions to optionally override the default settings in the Units class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetFormatOptions(
	FormatOptions formatOptions
)
Visual Basic
Public Sub SetFormatOptions ( _
	formatOptions As FormatOptions _
)
Visual C++
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
Parameters
formatOptions
Type: Autodesk.Revit.DB.FormatOptions
 The FormatOptions.
Remarks
 By default, the FormatOptions represents default formatting (UseDefault is true) and the FormatOptions in the Units class will be used.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ValueParsingOptions Class
Autodesk.Revit.DB Namespace